{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "808a5c45",
   "metadata": {},
   "source": [
    "# Notebook para realizar a limpeza do grafo após seu povoamento automático"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "431c30b2",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_community.graphs import Neo4jGraph\n",
    "from dotenv import load_dotenv\n",
    "import os\n",
    "import pandas as pd\n",
    "import matplotlib.pyplot as plt"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1a09cf96",
   "metadata": {},
   "source": [
    "Conectando ao NEO4J"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "6b62edd1",
   "metadata": {},
   "outputs": [],
   "source": [
    "load_dotenv()\n",
    "\n",
    "# Neo4j variables\n",
    "NEO4J_URL = os.getenv(\"NEO4J_URL\")\n",
    "NEO4J_USERNAME =os.getenv(\"NEO4J_USERNAME\")\n",
    "NEO4J_PASSWORD = os.getenv(\"NEO4J_PASSWORD\")\n",
    "\n",
    "#Connecting to the graph\n",
    "graph = Neo4jGraph(\n",
    "    url=NEO4J_URL,\n",
    "    username=NEO4J_USERNAME,\n",
    "    password=NEO4J_PASSWORD\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "26e0ddb0",
   "metadata": {},
   "source": [
    "Ajustando as URIs das classes CNPQ"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "ebb7559f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'(type(rel))': 'BFO_0000051'}]\n",
      "[{'(type(rel))': 'subject'}, {'(type(rel))': 'BFO_0000051'}, {'(type(rel))': 'mentions'}]\n"
     ]
    }
   ],
   "source": [
    "# Relacoes \"de\" e \"para\" dos nós CNPQ\n",
    "result = graph.query(f\"\"\"\n",
    "    MATCH (n:CNPQ)-[rel]->(o)\n",
    "    return distinct(type(rel)) \n",
    "            \"\"\")\n",
    "\n",
    "print (result)\n",
    "\n",
    "result = graph.query(f\"\"\"\n",
    "    MATCH (o)-[rel]->(n:CNPQ)\n",
    "    return distinct(type(rel)) \n",
    "            \"\"\")\n",
    "\n",
    "print (result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "743630bc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('tag:stardog:api:lyric', 'tag:stardog:api:letters', 'LETRAS')\n"
     ]
    }
   ],
   "source": [
    "# Ajustando as URI. Dada uma URI incorreta, mover todas as relações para a URI correta e deletar o nó com a URI incorreta.\n",
    "\n",
    "# URI incorreta, URI correta, novo label\n",
    "lista_correcao = [\n",
    "    #('tag:stardog:api:health_sciences', 'tag:stardog:api:health_science', 'CIÊNCIAS DA SAÚDE'),\n",
    "    #('tag:stardog:api:applied_social_sciences', 'tag:stardog:api:applied_social_science', 'CIÊNCIA SOCIAL APLICADA'),\n",
    "    #('tag:stardog:api:6090000__8_communication', 'tag:stardog:api:communication', 'COMUNICAÇÃO'),\n",
    "    #('tag:stardog:api:7030000__3_anthropology', 'tag:stardog:api:anthropology\t', 'ANTROPOLOGIA'),\n",
    "    #('tag:stardog:api:9180000__5_social_studies', 'tag:stardog:api:social_study', 'ESTUDOS SOCIAIS'),\n",
    "    #('tag:stardog:api:8020800__2_modern_foreign_literature', 'tag:stardog:api:modern_foreign_literature', 'LITERATURA ESTRANGEIRA MODERNA'),\n",
    "    #('tag:stardog:api:exact_and_earth_sciences', 'tag:stardog:api:exact_and_earth_science', 'CIÊNCIAS EXATAS E DA TERRA'),\n",
    "    #('tag:stardog:api:botanica','tag:stardog:api:botany', 'BOTÂNICA'),\n",
    "    #('tag:stardog:api:olympiads', 'tag:stardog:api:mathematic', 'MATEMÁTICA'),\n",
    "    #('tag:stardog:api:physical', 'tag:stardog:api:physic', 'FÍSICA'),\n",
    "    #('tag:stardog:api:chemical', 'tag:stardog:api:chemistry', 'QUÍMICA'), \n",
    "    #('tag:stardog:api:story', 'tag:stardog:api:history', 'Hístória'),\n",
    "    #('tag:stardog:api:theology_', 'tag:stardog:api:theology', 'TEOLOGIA'),\n",
    "    #('tag:stardog:api:right_', 'tag:stardog:api:right', 'DIREITO'),\n",
    "    ('tag:stardog:api:lyric', 'tag:stardog:api:letters', 'LETRAS')\n",
    "    ]\n",
    "\n",
    "for corr in lista_correcao:\n",
    "\n",
    "    graph.query(\"\"\"\n",
    "    MERGE (m:CNPQ{uri:'\"\"\" + corr[1] + \"\"\"'})\n",
    "    \"\"\")\n",
    "        \n",
    "    graph.query(\"\"\"\n",
    "    MATCH (n:CNPQ{uri:'\"\"\" + corr[0] + \"\"\"'})-[rel:BFO_0000051]->(o)\n",
    "    MATCH (m:CNPQ{uri:'\"\"\" + corr[1] + \"\"\"'})\n",
    "    MERGE (m)-[:BFO_0000051]->(o)\n",
    "    \"\"\")\n",
    "\n",
    "    graph.query(\"\"\"\n",
    "    MATCH (s)-[:subject]->(n:CNPQ{uri:'\"\"\" + corr[0] + \"\"\"'})\n",
    "    MATCH (m:CNPQ{uri:'\"\"\" + corr[1] + \"\"\"'})\n",
    "    MERGE (s)-[:subject]->(m)\n",
    "    \"\"\")\n",
    "\n",
    "    graph.query(\"\"\"\n",
    "    MATCH (s)-[:BFO_0000051]->(n:CNPQ{uri:'\"\"\" + corr[0] + \"\"\"'})\n",
    "    MATCH (m:CNPQ{uri:'\"\"\" + corr[1] + \"\"\"'})\n",
    "    MERGE (s)-[:BFO_0000051]->(m)\n",
    "    \"\"\")\n",
    "\n",
    "    graph.query(\"\"\"\n",
    "    MATCH (s)-[:mentions]->(n:CNPQ{uri:'\"\"\" + corr[0] + \"\"\"'})\n",
    "    MATCH (m:CNPQ{uri:'\"\"\" + corr[1] + \"\"\"'})\n",
    "    MERGE (s)-[:mentions]->(m)\n",
    "    \"\"\")\n",
    "\n",
    "    graph.query(\"\"\"\n",
    "    MATCH (m:CNPQ{uri:'\"\"\" + corr[1] + \"\"\"'})\n",
    "    SET m.label = '\"\"\" + corr[2] + \"\"\"'\n",
    "    \"\"\")\n",
    "\n",
    "    graph.query(\"\"\"\n",
    "    MATCH (m:CNPQ{uri:'\"\"\" + corr[0] + \"\"\"'})\n",
    "    DETACH DELETE (m)\n",
    "    \"\"\")\n",
    "\n",
    "    print (corr)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "09725d36",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('tag:stardog:api:agricultural_science', 'CIÊNCIAS AGRÁRIAS')\n",
      "('tag:stardog:api:biological_science', 'CIÊNCIAS BIOLÓGICAS')\n",
      "('tag:stardog:api:health_science', 'CIÊNCIAS DA SAÚDE')\n",
      "('tag:stardog:api:exact_and_earth_science', 'CIÊNCIAS EXATAS E DA TERRA')\n",
      "('tag:stardog:api:engineering', 'ENGENHARIAS')\n",
      "('tag:stardog:api:humanity', 'CIÊNCIAS HUMANAS')\n",
      "('tag:stardog:api:applied_social_science', 'CIÊNCIAS SOCIAIS APLICADAS')\n",
      "('tag:stardog:api:linguistic__letter_and_art', 'LINGÜÍSTICA, LETRAS E ARTES')\n",
      "('tag:stardog:api:history', 'HISTÓRIA')\n"
     ]
    }
   ],
   "source": [
    "# Ajustando labels das URI. Dada uma URI ajustar a label.\n",
    "\n",
    "# URI correta, novo label\n",
    "lista_correcao = [\n",
    "    ('tag:stardog:api:agricultural_science', 'CIÊNCIAS AGRÁRIAS'),\n",
    "    ('tag:stardog:api:biological_science', 'CIÊNCIAS BIOLÓGICAS'),\n",
    "    ('tag:stardog:api:health_science', 'CIÊNCIAS DA SAÚDE'),\n",
    "    ('tag:stardog:api:exact_and_earth_science', 'CIÊNCIAS EXATAS E DA TERRA'),\n",
    "    ('tag:stardog:api:engineering', 'ENGENHARIAS'),\n",
    "    ('tag:stardog:api:humanity', 'CIÊNCIAS HUMANAS'),\n",
    "    ('tag:stardog:api:applied_social_science', 'CIÊNCIAS SOCIAIS APLICADAS'),\n",
    "    ('tag:stardog:api:linguistic__letter_and_art', 'LINGÜÍSTICA, LETRAS E ARTES'),\n",
    "    ('tag:stardog:api:history', 'HISTÓRIA') ]\n",
    "\n",
    "for corr in lista_correcao:\n",
    "    graph.query(\"\"\"\n",
    "    MATCH (m:CNPQ{uri:'\"\"\" + corr[0] + \"\"\"'})\n",
    "    SET m.label = '\"\"\" + corr[1] + \"\"\"'\n",
    "    \"\"\")\n",
    "\n",
    "    print (corr)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "51cd9292",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "tag:stardog:api:600\n",
      "tag:stardog:api:8765449414823306929\n",
      "tag:stardog:api:_600\n",
      "tag:stardog:api:_7277407233034425144_\n",
      "tag:stardog:api:_2134759983998029892_\n"
     ]
    }
   ],
   "source": [
    "# Deletando um nó CNPQ específico que não deveria existir\n",
    "corr = ['tag:stardog:api:600',\n",
    "        'tag:stardog:api:8765449414823306929',\n",
    "        'tag:stardog:api:_600',\n",
    "        'tag:stardog:api:_7277407233034425144_',\n",
    "        'tag:stardog:api:_2134759983998029892_'\n",
    "        ]\n",
    "\n",
    "for uri in corr:\n",
    "    graph.query(f\"\"\"\n",
    "    MATCH (n:CNPQ{{uri:'{uri}'}})\n",
    "    DETACH DELETE (n)\n",
    "    \"\"\")\n",
    "\n",
    "    print (uri)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c7c70dd0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'t.uri': 'tag:stardog:api:analise_das_alteracoes_ambientais_na_lagoa_negra_viamaors__enfoque_na_qualidade_da_agua'},\n",
       " {'t.uri': 'tag:stardog:api:relacao_entre_a_concentracao_de_gelo_marinho_antartico_e_a_temperatura_minima_na_america_do_sul'},\n",
       " {'t.uri': 'tag:stardog:api:analise_de_aspectos_climatico_socioeconomico_e_ambiental_e_seus_efeitos_na_bacia_hidrografica_do_rio_urucui_preto_e_entorno'},\n",
       " {'t.uri': 'tag:stardog:api:impactos_das_mudancas_climaticas_na_biomassa_florestal_amazonica_previsao_de_perda_e_estrategias_de_conservacao_prioritarias_para_o_potencial_de_biomassa_sob_as_mudancas_climaticas'},\n",
       " {'t.uri': 'tag:stardog:api:racialidades_e_a_producao_de_artigos_cientificos_no_conhecimento_geografico_brasileiro_entre_2001_e_2018'},\n",
       " {'t.uri': 'tag:stardog:api:geoambientes_geoarqueologia_e_cenarios_de_mudancas_climaticas_na_ilha_de_marajo_amazonia_brasileira'},\n",
       " {'t.uri': 'tag:stardog:api:analises_geometrica_e_cinematica_mesomicroscopica_das_zonas_de_cisalhamento_palmeira_dos_indios_e_jacare_dos_homens_significancia_geodinamica_destas_estruturas_para_a_zona_de_limite_entre_o_dominio_pernambucoalagoas_e_a_faixa_sergipana'},\n",
       " {'t.uri': 'tag:stardog:api:drosophilidae_insecta_diptera_como_indicador_de_degradacao_florestal_na_area_de_endemismo_belem_amazonia_oriental'},\n",
       " {'t.uri': 'tag:stardog:api:a_zona_greisenizada_principal_do_macico_estanifero_mangabeira_go_geologia_petrologia_e_ocorrencia_de_indio_in'},\n",
       " {'t.uri': 'tag:stardog:api:paleogeografia_do_cretaceo_no_nordeste_do_brasil__abordagem_geoquimica_e_geocronologica_estrategica_das_bacias_do_araripe_sao_luis_e_grajau'},\n",
       " {'t.uri': 'tag:stardog:api:silenciamentos_da_geografia_brasileira_interseccionalidade_de_genero_e_raca_na_producao_de_artigos_cientificos_apos_os_anos_2000'}]"
      ]
     },
     "execution_count": 47,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Identificando teses ligadas a uma área do CNPQ\n",
    "uri = 'tag:stardog:api:geoscience'\n",
    "\n",
    "result = graph.query(\"\"\"\n",
    "        MATCH (n0:CNPQ{uri:'\"\"\" + uri + \"\"\"'})-[:BFO_0000051]->(n1:CNPQ)-[:BFO_0000051]->(n2:CNPQ)-[:BFO_0000051]->(n3:CNPQ)--(t:Thesis) \n",
    "        Return t.uri\n",
    "        UNION\n",
    "        MATCH (n0:CNPQ{uri:'\"\"\" + uri + \"\"\"'})-[:BFO_0000051]->(n1:CNPQ)-[:BFO_0000051]->(n2:CNPQ)--(t:Thesis) \n",
    "        Return t.uri\n",
    "        UNION\n",
    "        MATCH (n0:CNPQ{uri:'\"\"\" + uri + \"\"\"'})-[:BFO_0000051]->(n1:CNPQ)--(t:Thesis) \n",
    "        Return t.uri\n",
    "        UNION\n",
    "        MATCH (n0:CNPQ{uri:'\"\"\" + uri + \"\"\"'})--(t:Thesis) \n",
    "        Return t.uri\n",
    "        \"\"\")\n",
    "\n",
    "\n",
    "result[40:]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "9c89aa38",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Teses de Engenharia e Ciências Exatas e da Terra que foram consideradas fora do tema\n",
    "\n",
    "teses_excluir = [\n",
    "'tag:stardog:api:redes_neurais_artificiais_como_ferramenta_de_auxilio_na_operacao_e_controle_da_estacao_de_tratamento_de_agua_de_palmeira_dos_indios',\n",
    "'tag:stardog:api:proposta_de_uma_metodologia_para_suporte_a_decisao_deinvestimentos_em_portfolio_de_projetos_de_pesquisa_geologica_abordagem_atraves_do_modelo_de_opcoes_de_precos_de_black_escholes_e_simulacao_de_monte_carlo',\n",
    "'tag:stardog:api:desenvolvimento_e_aplicacao_de_biocoagulante_magnetico_fe3o4mo_para_remocao_do_corante_reativo_preto_5_em_meio_aquoso_sintetico_e_efluente_real_textil',\n",
    "'tag:stardog:api:producao_de_biogas_em_resposta_ao_pretratamento_quimico_e_reuso_do_liquor_negro_aplicado_aos_residuos_de_aparas_de_grama',\n",
    "'tag:stardog:api:modelo_matematico_para_manejo_de_black_bass_m_salmoides_lacepede_1802_em_reservatorios',\n",
    "'tag:stardog:api:determinacao_de_mp25_e_black_carbon_em_decorrencia_da_queima_ilegal_de_residuos_solidos_urbanos',\n",
    "'tag:stardog:api:ozonizacao_e_oxidacao_com_persulfato_de_sodio_do_corante_azo_reactive_black_5_cinetica_formacao_de_subprodutos_e_metodologia_de_superficie_de_resposta',\n",
    "'tag:stardog:api:monitoramento_da_exposicao_pessoal_ao_poluente_atmosferico_black_carbon',\n",
    "'tag:stardog:api:localizacao_e_planejamento_de_caminhos_para_um_robo_humanoide_e_um_robo_escravo_com_rodas',\n",
    "'tag:stardog:api:uma_metodologia_para_simulacao_numerica_tridimensional_de_reservatorios_de_petroleo_utilizando_modelo_blackoil_e_formulacao_em_fracoes_massicas',\n",
    "'tag:stardog:api:modelagem_computacional_e_analise_termodinamica_de_sistemas_de_geracao_de_potencia_utilizando_gaseificacao_de_licor_negro',\n",
    "'tag:stardog:api:obtencao_e_caracterizacao_de_nanolubrificantes_utilizados_em_refrigeracao_aditivados_com_nanoparticulas_de_indio_in',\n",
    "'tag:stardog:api:fabricacao_de_compositos_de_poli_fluoreto_de_vinilidenonegro_de_fumo_condutor_pvdfnfc_por_sinterizacao_seletiva_a_laser',\n",
    "'tag:stardog:api:propriedades_opticas_de_vidros_de_fluoretos_de_indio_e_zirconio_puros_e_dopados_com_nd_ou_pr',\n",
    "'tag:stardog:api:controle_mestreescravo_sem_comunicacao_para_conversores_de_potencia_aplicados_a_microrredes',\n",
    "'tag:stardog:api:comparacao_entre_controle_por_inclinacao_e_controle_mestreescravo_sem_comunicacao_em_microrredes_operando_no_modo_autonomo',\n",
    "'tag:stardog:api:otimizacao_multiobjetivo_de_black_start_em_microrredes_com_insercao_de_geracao_distribuida_intermitente',\n",
    "'tag:stardog:api:obtencao_de_materiais_absorvedores_de_microondas_a_base_de_compositos_condutores_de_negro_de_fumo_e_nanotubos_de_carbono_impregnados_com_poma',\n",
    "'tag:stardog:api:sintese_de_hidroxido_de_indio_iii_substituido_parcialmente_por_zn2_com_propriedades_fotocataliticas_e_ag_com_propriedades_bactericidas',\n",
    "'tag:stardog:api:producao_e_caracterizacao_de_compositos_de_pebdal_oriundos_de_embalagens_longa_vida_com_podeborracha_de_pneus_ou_negro_de_fumo',\n",
    "'tag:stardog:api:metodologia_baseada_em_metamodelos_para_a_otimizacao_global_de_problemas_blackbox_com_restricoes_computacionalmente_onerosas',\n",
    "'tag:stardog:api:influencia_da_composicao_mineral_e_fluida_sobre_as_propriedades_petrofisicas_de_folhelhos_negros_estudo_de_caso_bacia_do_araripe',\n",
    "'tag:stardog:api:implementacao_do_modelo_de_ordem_reduzida_tpwl_para_simulacao_de_reservatorios_de_petroleo_na_plataforma_mrst',\n",
    "'tag:stardog:api:metodologia_de_selecao_de_algoritmos_para_problemas_de_otimizacao_continua_e_com_formulacao_blackbox',\n",
    "'tag:stardog:api:construcao_de_tabelas_de_seno_nas_civilizacoes_grega_arabe_e_indiana',\n",
    "'tag:stardog:api:teste_funcional_sistematico_estendido_uma_contribuicao_na_aplicacao_de_criterios_de_teste_caixapreta',\n",
    "'tag:stardog:api:paralelizacao_hibrida_do_algoritmo_black_hole_em_um_system_on_chip',\n",
    "'tag:stardog:api:proposta_de_uma_linguagem_especifica_de_dominio_de_programacao_paralela_orientada_a_padroes_paralelos_um_estudo_de_caso_baseado_no_padrao_mestreescravo_para_arquiteturas_multicore',\n",
    "'tag:stardog:api:um_protocolo_de_roteamento_resistente_a_ataques_blackhole_sem_deteccao_de_nos_maliciosos',\n",
    "'tag:stardog:api:an_analytic_study_of_lensing_by_black_holes_in_kerrde_sitter_spacetimes',\n",
    "'tag:stardog:api:secao_de_choque_de_absorcao_de_buracos_negros_de_schwarzschild_e_de_buracos_acusticos_canonicos',\n",
    "'tag:stardog:api:termodinamica_de_buracos_negros_de_schwarzschild',\n",
    "'tag:stardog:api:magnetismo_d0_em_oxidos_de_in2o3_e_sn1xcexo2',\n",
    "'tag:stardog:api:estudos_por_espectroscopia_raman_da_heteroestrutura_semicondutora_inxga1xpgaas',\n",
    "'tag:stardog:api:contraste_entre_propriedades_optoeletronicas_em_estruturas_de_tunelamento_ressonante_nin_baseadas_em_gaas',\n",
    "'tag:stardog:api:condicoes_de_energia_de_hawking_e_ellis_e_a_equacao_de_raychaudhuri',\n",
    "'tag:stardog:api:radiacao_de_corpo_negro_do_campo_escalar_no_universo_de_einstein',\n",
    "'tag:stardog:api:proposta_de_unidade_de_ensino_potencialmente_significativa_em_radiacao_do_corpo_negro_e_efeito_fotoeletrico',\n",
    "'tag:stardog:api:optical_analogue_models_for_black_holes_and_wormholes',\n",
    "'tag:stardog:api:construcao_e_avaliacao_de_eletrodos_por_serigrafia_empregando_negro_de_fumo_como_material_condutor',\n",
    "'tag:stardog:api:mangue_preto_avicennia_schaueriana_na_fitorremediacao_de_hidrocarbonetos_policiclicos_aromaticos_em_sedimento_de_manguezal_contaminado_por_petroleo',\n",
    "'tag:stardog:api:winds_and_feedback_from_underfed_supermassive_black_holes_ventos_e_feedback_de_buracos_negros_acretando_a_baixas_taxas',\n",
    "'tag:stardog:api:paralelizacao_hibrida_do_algoritmo_black_hole_em_um_system_on_chip',\n",
    "'tag:stardog:api:buraco_negros_correspondencia_adsbcft_e_fluidogravidade',\n",
    "'tag:stardog:api:estudo_do_processo_de_acidificacao_de_rochas_reservatorio_por_meio_de_rmn_e_microtomografia_de_raiosx',\n",
    "'tag:stardog:api:desenvolvimento_de_sistemas_microemulsionados_retardados_para_aplicacao_na_estimulacao_acida_em_reservatorios_carbonaticos']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "563769b8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "tag:stardog:api:redes_neurais_artificiais_como_ferramenta_de_auxilio_na_operacao_e_controle_da_estacao_de_tratamento_de_agua_de_palmeira_dos_indios\n",
      "tag:stardog:api:proposta_de_uma_metodologia_para_suporte_a_decisao_deinvestimentos_em_portfolio_de_projetos_de_pesquisa_geologica_abordagem_atraves_do_modelo_de_opcoes_de_precos_de_black_escholes_e_simulacao_de_monte_carlo\n",
      "tag:stardog:api:desenvolvimento_e_aplicacao_de_biocoagulante_magnetico_fe3o4mo_para_remocao_do_corante_reativo_preto_5_em_meio_aquoso_sintetico_e_efluente_real_textil\n",
      "tag:stardog:api:producao_de_biogas_em_resposta_ao_pretratamento_quimico_e_reuso_do_liquor_negro_aplicado_aos_residuos_de_aparas_de_grama\n",
      "tag:stardog:api:modelo_matematico_para_manejo_de_black_bass_m_salmoides_lacepede_1802_em_reservatorios\n",
      "tag:stardog:api:determinacao_de_mp25_e_black_carbon_em_decorrencia_da_queima_ilegal_de_residuos_solidos_urbanos\n",
      "tag:stardog:api:ozonizacao_e_oxidacao_com_persulfato_de_sodio_do_corante_azo_reactive_black_5_cinetica_formacao_de_subprodutos_e_metodologia_de_superficie_de_resposta\n",
      "tag:stardog:api:monitoramento_da_exposicao_pessoal_ao_poluente_atmosferico_black_carbon\n",
      "tag:stardog:api:localizacao_e_planejamento_de_caminhos_para_um_robo_humanoide_e_um_robo_escravo_com_rodas\n",
      "tag:stardog:api:uma_metodologia_para_simulacao_numerica_tridimensional_de_reservatorios_de_petroleo_utilizando_modelo_blackoil_e_formulacao_em_fracoes_massicas\n",
      "tag:stardog:api:modelagem_computacional_e_analise_termodinamica_de_sistemas_de_geracao_de_potencia_utilizando_gaseificacao_de_licor_negro\n",
      "tag:stardog:api:obtencao_e_caracterizacao_de_nanolubrificantes_utilizados_em_refrigeracao_aditivados_com_nanoparticulas_de_indio_in\n",
      "tag:stardog:api:fabricacao_de_compositos_de_poli_fluoreto_de_vinilidenonegro_de_fumo_condutor_pvdfnfc_por_sinterizacao_seletiva_a_laser\n",
      "tag:stardog:api:propriedades_opticas_de_vidros_de_fluoretos_de_indio_e_zirconio_puros_e_dopados_com_nd_ou_pr\n",
      "tag:stardog:api:controle_mestreescravo_sem_comunicacao_para_conversores_de_potencia_aplicados_a_microrredes\n",
      "tag:stardog:api:comparacao_entre_controle_por_inclinacao_e_controle_mestreescravo_sem_comunicacao_em_microrredes_operando_no_modo_autonomo\n",
      "tag:stardog:api:otimizacao_multiobjetivo_de_black_start_em_microrredes_com_insercao_de_geracao_distribuida_intermitente\n",
      "tag:stardog:api:obtencao_de_materiais_absorvedores_de_microondas_a_base_de_compositos_condutores_de_negro_de_fumo_e_nanotubos_de_carbono_impregnados_com_poma\n",
      "tag:stardog:api:sintese_de_hidroxido_de_indio_iii_substituido_parcialmente_por_zn2_com_propriedades_fotocataliticas_e_ag_com_propriedades_bactericidas\n",
      "tag:stardog:api:producao_e_caracterizacao_de_compositos_de_pebdal_oriundos_de_embalagens_longa_vida_com_podeborracha_de_pneus_ou_negro_de_fumo\n",
      "tag:stardog:api:metodologia_baseada_em_metamodelos_para_a_otimizacao_global_de_problemas_blackbox_com_restricoes_computacionalmente_onerosas\n",
      "tag:stardog:api:influencia_da_composicao_mineral_e_fluida_sobre_as_propriedades_petrofisicas_de_folhelhos_negros_estudo_de_caso_bacia_do_araripe\n",
      "tag:stardog:api:implementacao_do_modelo_de_ordem_reduzida_tpwl_para_simulacao_de_reservatorios_de_petroleo_na_plataforma_mrst\n",
      "tag:stardog:api:metodologia_de_selecao_de_algoritmos_para_problemas_de_otimizacao_continua_e_com_formulacao_blackbox\n",
      "tag:stardog:api:construcao_de_tabelas_de_seno_nas_civilizacoes_grega_arabe_e_indiana\n",
      "tag:stardog:api:teste_funcional_sistematico_estendido_uma_contribuicao_na_aplicacao_de_criterios_de_teste_caixapreta\n",
      "tag:stardog:api:paralelizacao_hibrida_do_algoritmo_black_hole_em_um_system_on_chip\n",
      "tag:stardog:api:proposta_de_uma_linguagem_especifica_de_dominio_de_programacao_paralela_orientada_a_padroes_paralelos_um_estudo_de_caso_baseado_no_padrao_mestreescravo_para_arquiteturas_multicore\n",
      "tag:stardog:api:um_protocolo_de_roteamento_resistente_a_ataques_blackhole_sem_deteccao_de_nos_maliciosos\n",
      "tag:stardog:api:an_analytic_study_of_lensing_by_black_holes_in_kerrde_sitter_spacetimes\n",
      "tag:stardog:api:secao_de_choque_de_absorcao_de_buracos_negros_de_schwarzschild_e_de_buracos_acusticos_canonicos\n",
      "tag:stardog:api:termodinamica_de_buracos_negros_de_schwarzschild\n",
      "tag:stardog:api:magnetismo_d0_em_oxidos_de_in2o3_e_sn1xcexo2\n",
      "tag:stardog:api:estudos_por_espectroscopia_raman_da_heteroestrutura_semicondutora_inxga1xpgaas\n",
      "tag:stardog:api:contraste_entre_propriedades_optoeletronicas_em_estruturas_de_tunelamento_ressonante_nin_baseadas_em_gaas\n",
      "tag:stardog:api:condicoes_de_energia_de_hawking_e_ellis_e_a_equacao_de_raychaudhuri\n",
      "tag:stardog:api:radiacao_de_corpo_negro_do_campo_escalar_no_universo_de_einstein\n",
      "tag:stardog:api:proposta_de_unidade_de_ensino_potencialmente_significativa_em_radiacao_do_corpo_negro_e_efeito_fotoeletrico\n",
      "tag:stardog:api:optical_analogue_models_for_black_holes_and_wormholes\n",
      "tag:stardog:api:construcao_e_avaliacao_de_eletrodos_por_serigrafia_empregando_negro_de_fumo_como_material_condutor\n",
      "tag:stardog:api:mangue_preto_avicennia_schaueriana_na_fitorremediacao_de_hidrocarbonetos_policiclicos_aromaticos_em_sedimento_de_manguezal_contaminado_por_petroleo\n",
      "tag:stardog:api:winds_and_feedback_from_underfed_supermassive_black_holes_ventos_e_feedback_de_buracos_negros_acretando_a_baixas_taxas\n",
      "tag:stardog:api:paralelizacao_hibrida_do_algoritmo_black_hole_em_um_system_on_chip\n",
      "tag:stardog:api:buraco_negros_correspondencia_adsbcft_e_fluidogravidade\n",
      "tag:stardog:api:estudo_do_processo_de_acidificacao_de_rochas_reservatorio_por_meio_de_rmn_e_microtomografia_de_raiosx\n",
      "tag:stardog:api:desenvolvimento_de_sistemas_microemulsionados_retardados_para_aplicacao_na_estimulacao_acida_em_reservatorios_carbonaticos\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 56,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Deletando teses\n",
    "\n",
    "for uri in teses_excluir:\n",
    "    graph.query(f\"\"\"\n",
    "    MATCH (t:Thesis{{uri:'{uri}'}})\n",
    "    DETACH DELETE (t)\n",
    "    \"\"\")\n",
    "\n",
    "    print (uri)\n",
    "\n",
    "# Deletando as Excerpts sem teses \n",
    "graph.query(f\"\"\"\n",
    "MATCH (e:Excerpt)\n",
    "WHERE NOT (e)--(:Thesis)\n",
    "DETACH DELETE (e)\n",
    "    \"\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6fe1e4f1",
   "metadata": {},
   "source": [
    "Corrigindo as entidades"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "133b6121",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "tag:stardog:api:equador\n"
     ]
    }
   ],
   "source": [
    "# Uma entidade foi classificada erroneamente como pessoa, mas é um local.\n",
    "# A label 'person' deve ser removida, mas mantida a label 'place'\n",
    "\n",
    "uris = [\n",
    "    #'tag:stardog:api:es',\n",
    "    #'tag:stardog:api:amazonia',\n",
    "    #'tag:stardog:api:terra',\n",
    "    #'tag:stardog:api:porto_alegre',\n",
    "    #'tag:stardog:api:recife',\n",
    "    #'tag:stardog:api:maranhao',\n",
    "    #'tag:stardog:api:rj',\n",
    "    #'tag:stardog:api:franca',\n",
    "    #'tag:stardog:api:parana',\n",
    "    #'tag:stardog:api:mato_grosso',\n",
    "    #'tag:stardog:api:ba',\n",
    "    #'tag:stardog:api:angola',\n",
    "    #'tag:stardog:api:pr',\n",
    "    #'tag:stardog:api:eua',\n",
    "    #'tag:stardog:api:rio',\n",
    "    #'tag:stardog:api:norte',\n",
    "    #'tag:stardog:api:rio_negro',\n",
    "    #'tag:stardog:api:goias',\n",
    "    #'tag:stardog:api:ceara',\n",
    "    #'tag:stardog:api:pe',\n",
    "    #'tag:stardog:api:pais',\n",
    "    #'tag:stardog:api:ma',\n",
    "    #'tag:stardog:api:espirito_santo',\n",
    "    #'tag:stardog:api:roraima',\n",
    "    #'tag:stardog:api:provincia',\n",
    "    #'tag:stardog:api:holanda',\n",
    "    #'tag:stardog:api:equador',\n",
    "]\n",
    "\n",
    "for uri in uris:\n",
    "    result = graph.query(f\"\"\"\n",
    "                MATCH (n{{uri:'{uri}'}})\n",
    "                REMOVE n:Person\n",
    "                RETURN n\n",
    "                \"\"\")\n",
    "    \n",
    "    print (result[0]['n']['uri'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6479e31c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "tag:stardog:api:rodrigues\n"
     ]
    }
   ],
   "source": [
    "# Uma entidade foi classificada erroneamente como local, mas é uma pessoa.\n",
    "# A label 'place' deve ser removida, mas mantida a label 'person'\n",
    "\n",
    "uris = [\n",
    "    #'tag:stardog:api:oliveira',\n",
    "    #'tag:stardog:api:deus',\n",
    "    #'tag:stardog:api:lima',\n",
    "    #'tag:stardog:api:pereira',\n",
    "    #'tag:stardog:api:santos',  \n",
    "    #'tag:stardog:api:ribeiro',\n",
    "    #'tag:stardog:api:kaingang',\n",
    "    #'tag:stardog:api:ferreira',\n",
    "    #'tag:stardog:api:souza',\n",
    "    #'tag:stardog:api:castro',\n",
    "    #'tag:stardog:api:rodrigues',  \t\n",
    "]\n",
    "\n",
    "for uri in uris:\n",
    "    result = graph.query(f\"\"\"\n",
    "                MATCH (n{{uri:'{uri}'}})\n",
    "                REMOVE n:Place\n",
    "                RETURN n\n",
    "                \"\"\")\n",
    "    \n",
    "    print (result[0]['n']['uri'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "b4c963b3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "tag:stardog:api:mec\n"
     ]
    }
   ],
   "source": [
    "# Uma entidade foi classificada erroneamente como local (ou pessoa) e uma terceira label.\n",
    "# A label 'place' e 'place' deve ser removida, mas mantida as outras labels\n",
    "\n",
    "uris = [\n",
    "    #'tag:stardog:api:paz',\n",
    "    #'tag:stardog:api:usp',\n",
    "    #'tag:stardog:api:indigena',\n",
    "    #'tag:stardog:api:negro',\n",
    "    #'tag:stardog:api:sus', \n",
    "    #'tag:stardog:api:mec'   \t\n",
    "]\n",
    "\n",
    "for uri in uris:\n",
    "    result = graph.query(f\"\"\"\n",
    "                MATCH (n{{uri:'{uri}'}})\n",
    "                REMOVE n:Place:Person\n",
    "                RETURN n\n",
    "                \"\"\")\n",
    "    \n",
    "    print (result[0]['n']['uri'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "88b8456a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "tag:stardog:api:mec  - Entidade com outras labels -  [{'labels': ['Resource', 'Place', 'Subject']}, {'labels': ['Person']}]\n"
     ]
    }
   ],
   "source": [
    "# Uma entidade foi classificada erroneamente como pessoa e não deveria ser uma entidade (não é um local)\n",
    "# O nó deve ser deletado\n",
    "\n",
    "uris = [\n",
    "    #'tag:stardog:api:idem',\n",
    "    #'tag:stardog:api:tese',\n",
    "    #'tag:stardog:api:cf',\n",
    "   # 'tag:stardog:api:ibid',\n",
    "   # 'tag:stardog:api:imperio',\n",
    "   # 'tag:stardog:api:ed',\n",
    "   # 'tag:stardog:api:prof',\n",
    "   # 'tag:stardog:api:dissertacao',\n",
    "   # 'tag:stardog:api:historia',\n",
    "   # 'tag:stardog:api:dra',\n",
    "   # 'tag:stardog:api:agradeco',\n",
    "   # 'tag:stardog:api:mestrado',\n",
    "   # 'tag:stardog:api:educacao',\n",
    "   # 'tag:stardog:api:ibge',\n",
    "   # 'tag:stardog:api:org',\n",
    "   # 'tag:stardog:api:universidade_de_sao_paulo',\n",
    "   # 'tag:stardog:api:ciencias_sociais',\n",
    "   # 'tag:stardog:api:ess',\n",
    "   # 'tag:stardog:api:governo',\n",
    "   # 'tag:stardog:api:hucitec',\n",
    "   # 'tag:stardog:api:op',\n",
    "   # 'tag:stardog:api:saude',\n",
    "   # 'tag:stardog:api:mapa',\n",
    "   # 'tag:stardog:api:cultura',\n",
    "   # 'tag:stardog:api:escola'\t,\n",
    "   #'tag:stardog:api:republica',\n",
    "   ,\t\n",
    "]\n",
    "\n",
    "for uri in uris:\n",
    "\n",
    "    result = graph.query(f\"\"\"\n",
    "                MATCH (n{{uri:'{uri}'}})\n",
    "                RETURN labels (n) as labels\n",
    "                \"\"\")\n",
    "    \n",
    "    labels_bool = True\n",
    "    for res in result:\n",
    "        labels_bool = labels_bool & (set(res['labels']) == set(['Resource', 'Person', 'Place']))\n",
    "    \n",
    "    # Entidade com label 'Resource', 'Person', 'Place'\n",
    "    if labels_bool:\n",
    "\n",
    "        graph.query(f\"\"\"\n",
    "                    MATCH (n{{uri:'{uri}'}})\n",
    "                    DETACH DELETE (n)\n",
    "                    \"\"\")\n",
    "    \n",
    "        print (uri, ' - Entidade com label Resource, Person, Place')\n",
    "\n",
    "    else:\n",
    "        # Entidade com label 'Resource', 'Person', 'Place' mas em dois nós diferentes\n",
    "        if ((result == [{'labels': ['Place']}, {'labels': ['Resource', 'Person']}]) |\n",
    "           (result == [{'labels': ['Resource', 'Person']}, {'labels': ['Place']}]) |\n",
    "           (result == [{'labels': ['Person']}, {'labels': ['Place']}]) |\n",
    "           (result == [{'labels': ['Resource', 'Place']}]) |\n",
    "           (result == [{'labels': ['Resource', 'Place']}, {'labels': ['Person']}])):\n",
    "            graph.query(f\"\"\"\n",
    "                    MATCH (n{{uri:'{uri}'}})\n",
    "                    DETACH DELETE (n)\n",
    "                    \"\"\")\n",
    "            print (uri, ' - Entidade com label Resource, Person, Place mas em dois nós diferentes')\n",
    "        \n",
    "        # Entidade com outras labels\n",
    "        else:\n",
    "            print (uri, ' - Entidade com outras labels - ', result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b42a2c30",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "tag:stardog:api:f\n"
     ]
    }
   ],
   "source": [
    "# Uma uri que nao deveria ser um nó (local, pessoa nem outra classe)\n",
    "# O nó deve ser deletado\n",
    "\n",
    "uris = [\n",
    "    #'tag:stardog:api:t',\n",
    "    #'tag:stardog:api:j',\n",
    "    #'tag:stardog:api:d',\n",
    "    #'tag:stardog:api:f'\n",
    "    ]\n",
    "\n",
    "for uri in uris:\n",
    "\n",
    "    result = graph.query(f\"\"\"\n",
    "                MATCH (n{{uri:'{uri}'}})\n",
    "                DETACH DELETE (n)\n",
    "                \"\"\")\n",
    "    print (uri)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9fdfb524",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv-IndigSlave (3.11.9)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
