{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "#!python -m spacy download pt_core_news_lg\n",
    "#!python -m spacy download en_core_web_lg\n",
    "#%pip install -U scikit-learn"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import io\n",
    "import stardog\n",
    "import pandas as pd\n",
    "import spacy\n",
    "from spacy import displacy\n",
    "from sklearn.cluster import DBSCAN\n",
    "import numpy as np\n",
    "import requests\n",
    "from unidecode import unidecode\n",
    "import re\n",
    "import json\n",
    "from langdetect import detect"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Specify Stardog connection details"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Stardog variables\n",
    "STARDOG_ENDPOINT = os.getenv('STARDOG_ENDPOINT')\n",
    "STARDOG_USERNAME = os.getenv(\"STARDOG_USERNAME\")\n",
    "STARDOG_PASSWORD = os.getenv(\"STARDOG_PASSWORD\")\n",
    "\n",
    "connection_details = {\n",
    "    'endpoint': STARDOG_ENDPOINT,\n",
    "    'username': STARDOG_USERNAME,\n",
    "    'password': STARDOG_PASSWORD\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "database_name = 'IndigenousSlavery'\n",
    "conn = stardog.Connection(database_name, **connection_details)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>thesis</th>\n",
       "      <th>abstract</th>\n",
       "      <th>lang</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>tag:stardog:api:en_an_abolicionist_argument_pe...</td>\n",
       "      <td>[pt] O presente trabalho busca fazer uma retom...</td>\n",
       "      <td>pt</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>tag:stardog:api:percepcoes_dos_pesquisadores_d...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>pt</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>tag:stardog:api:com_a_condicao_de_servir_gratu...</td>\n",
       "      <td>A presente pesquisa parte da emancipação de es...</td>\n",
       "      <td>pt</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>tag:stardog:api:entre_as_pessoas_mais_gradas_d...</td>\n",
       "      <td>O objeto central que baliza esta pesquisa é a ...</td>\n",
       "      <td>pt</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>tag:stardog:api:saraiva_dantas_e_cotegipe_baia...</td>\n",
       "      <td>A presente tese investiga o baianismo e suas i...</td>\n",
       "      <td>pt</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22705</th>\n",
       "      <td>tag:stardog:api:micropropagacao_fotoautotrofic...</td>\n",
       "      <td>The success of mass micropropagation of fruit ...</td>\n",
       "      <td>en</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22706</th>\n",
       "      <td>tag:stardog:api:contrastes_e_continuidades_em_...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>pt</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22707</th>\n",
       "      <td>tag:stardog:api:assombro_de_olhada_de_bicho_um...</td>\n",
       "      <td>This ethnography has as an objective to compre...</td>\n",
       "      <td>en</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22708</th>\n",
       "      <td>tag:stardog:api:o_devirclandestino_em_marcados...</td>\n",
       "      <td>In the dissertation O devir-clandestino em Mar...</td>\n",
       "      <td>en</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22709</th>\n",
       "      <td>tag:stardog:api:volver_a_ser_uno_contra_el_tie...</td>\n",
       "      <td>Dissertação apresentada ao Programa de Pós-Gra...</td>\n",
       "      <td>pt</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>22710 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                  thesis  \\\n",
       "0      tag:stardog:api:en_an_abolicionist_argument_pe...   \n",
       "1      tag:stardog:api:percepcoes_dos_pesquisadores_d...   \n",
       "2      tag:stardog:api:com_a_condicao_de_servir_gratu...   \n",
       "3      tag:stardog:api:entre_as_pessoas_mais_gradas_d...   \n",
       "4      tag:stardog:api:saraiva_dantas_e_cotegipe_baia...   \n",
       "...                                                  ...   \n",
       "22705  tag:stardog:api:micropropagacao_fotoautotrofic...   \n",
       "22706  tag:stardog:api:contrastes_e_continuidades_em_...   \n",
       "22707  tag:stardog:api:assombro_de_olhada_de_bicho_um...   \n",
       "22708  tag:stardog:api:o_devirclandestino_em_marcados...   \n",
       "22709  tag:stardog:api:volver_a_ser_uno_contra_el_tie...   \n",
       "\n",
       "                                                abstract lang  \n",
       "0      [pt] O presente trabalho busca fazer uma retom...   pt  \n",
       "1                                                    NaN   pt  \n",
       "2      A presente pesquisa parte da emancipação de es...   pt  \n",
       "3      O objeto central que baliza esta pesquisa é a ...   pt  \n",
       "4      A presente tese investiga o baianismo e suas i...   pt  \n",
       "...                                                  ...  ...  \n",
       "22705  The success of mass micropropagation of fruit ...   en  \n",
       "22706                                                NaN   pt  \n",
       "22707  This ethnography has as an objective to compre...   en  \n",
       "22708  In the dissertation O devir-clandestino em Mar...   en  \n",
       "22709  Dissertação apresentada ao Programa de Pós-Gra...   pt  \n",
       "\n",
       "[22710 rows x 3 columns]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Query que busca as teses e os seus abstracts. Foi incluído um filtro para buscar apenas \n",
    "# os abstract em português, inglês ou em outra língua\n",
    "query = \"\"\"\n",
    "SELECT ?thesis ?abstract (lang(?abstract) AS ?lang) WHERE {\n",
    "  ?thesis a <http://purl.org/ontology/bibo/Thesis>.\n",
    "  ?thesis <http://purl.org/ontology/bibo/abstract> ?abstract.\n",
    "  FILTER (lang(?abstract) IN(\"pt\", \"en\"))\n",
    "  \n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "query2 = \"\"\"\n",
    "SELECT ?thesis ?ent  WHERE {\n",
    "  ?thesis a <http://purl.org/ontology/bibo/Thesis>.\n",
    "  ?thesis <https://schema.org/mentions> ?ent.  \n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "query3 = \"\"\"\n",
    "SELECT ?place   WHERE {\n",
    "  ?place a <https://schema.org/Place>. \n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "# FILTER (langMatches(lang(?abstract),\"pt\"))\n",
    "# FILTER (langMatches(lang(?abstract),\"en\"))\n",
    "# FILTER (lang(?abstract) NOT IN(\"pt\", \"en\"))\n",
    "# LIMIT 20\n",
    "\n",
    "csv_results = conn.select(query, content_type='text/csv')\n",
    "thesis_abstract = pd.read_csv(io.BytesIO(csv_results))\n",
    "thesis_abstract\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "499  teses processadas.\n",
      "999  teses processadas.\n",
      "1499  teses processadas.\n",
      "1999  teses processadas.\n",
      "2499  teses processadas.\n",
      "2999  teses processadas.\n",
      "3499  teses processadas.\n",
      "3999  teses processadas.\n",
      "4499  teses processadas.\n",
      "4999  teses processadas.\n",
      "5499  teses processadas.\n",
      "5999  teses processadas.\n",
      "6499  teses processadas.\n",
      "6999  teses processadas.\n",
      "7499  teses processadas.\n",
      "7999  teses processadas.\n",
      "8499  teses processadas.\n",
      "8999  teses processadas.\n",
      "9499  teses processadas.\n",
      "9999  teses processadas.\n",
      "10499  teses processadas.\n",
      "10999  teses processadas.\n",
      "11499  teses processadas.\n",
      "11999  teses processadas.\n",
      "12499  teses processadas.\n",
      "12999  teses processadas.\n",
      "13499  teses processadas.\n",
      "13999  teses processadas.\n",
      "14499  teses processadas.\n",
      "14999  teses processadas.\n",
      "15499  teses processadas.\n",
      "15999  teses processadas.\n",
      "16499  teses processadas.\n",
      "16999  teses processadas.\n",
      "17499  teses processadas.\n",
      "17999  teses processadas.\n",
      "18499  teses processadas.\n",
      "18999  teses processadas.\n",
      "19499  teses processadas.\n",
      "19999  teses processadas.\n",
      "20499  teses processadas.\n",
      "20999  teses processadas.\n",
      "21499  teses processadas.\n",
      "21999  teses processadas.\n",
      "22499  teses processadas.\n"
     ]
    }
   ],
   "source": [
    "# Extraíndo as entidades dos abstracts\n",
    "\n",
    "#Carregando os modelos SpaCy para inglês e português \n",
    "nlp_en = spacy.load(\"en_core_web_lg\")\n",
    "nlp_pt = spacy.load(\"pt_core_news_lg\")\n",
    "\n",
    "#Dicionário que receberá as instâncias de cada tese\n",
    "instances_dic = {}\n",
    "\n",
    "for n in range(len(thesis_abstract)):\n",
    "\n",
    "    # Processando os abstracts em português\n",
    "    if thesis_abstract['lang'][n] == 'pt':\n",
    "\n",
    "        doc_pt = nlp_pt(str(thesis_abstract['abstract'][n]))\n",
    "        persons = []\n",
    "        gpes = []\n",
    "        #orgs = []\n",
    "        for ent in doc_pt.ents:\n",
    "            if ent.label_ == \"PER\": #\"PERSON\":\n",
    "                persons.append(ent)\n",
    "            if ent.label_ == \"LOC\": #\"GPE\":\n",
    "                gpes.append(ent)\n",
    "            #if ent.label_ == \"ORG\":\n",
    "            #    orgs.append(ent)\n",
    "\n",
    "        #instances_dic[thesis_abstract['thesis'][n].replace('tag:stardog:api:','')] = {'PER':persons, 'LOC':gpes, 'ORG':orgs, 'lang': 'pt'}\n",
    "        instances_dic[thesis_abstract['thesis'][n].replace('tag:stardog:api:','')] = {'PER':persons, 'LOC':gpes, 'lang': 'pt'}\n",
    "\n",
    "    # Processando os abstracts em inglês\n",
    "    if thesis_abstract['lang'][n] == 'en':\n",
    "\n",
    "        doc_en = nlp_en(str(thesis_abstract['abstract'][n]))\n",
    "        persons = []\n",
    "        gpes = []\n",
    "        #orgs = []\n",
    "        for ent in doc_en.ents:\n",
    "            if ent.label_ == \"PERSON\":\n",
    "                persons.append(ent)\n",
    "            if ent.label_ == \"GPE\":\n",
    "                gpes.append(ent)\n",
    "            #if ent.label_ == \"ORG\":\n",
    "            #    orgs.append(ent)\n",
    "\n",
    "        #instances_dic[thesis_abstract['thesis'][n].replace('tag:stardog:api:','')] = {'PER':persons, 'LOC':gpes, 'ORG':orgs, 'lang': 'en'}\n",
    "        instances_dic[thesis_abstract['thesis'][n].replace('tag:stardog:api:','')] = {'PER':persons, 'LOC':gpes, 'lang': 'en'}\n",
    "\n",
    "    if n%500 == 499:\n",
    "        print(n, \" teses processadas.\")\n",
    "    #    break"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Funcão que recebe uma string e a limpar para ficar no formato aceitável para uma URI\n",
    "def process_uri(x):\n",
    "    return (re.sub('[^a-zA-Z0-9_ ]', '',\n",
    "            unidecode(x.strip())\n",
    "                        .replace(\" \", \"_\")\n",
    "                        .replace(\"[\",\"\")\n",
    "                        .replace(\"]\",\"\")\n",
    "                        .replace(\"?\",\"\")\n",
    "                        .replace(\"'\",\"\")\n",
    "                        .lower()))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Criando URIs para as entidades\n",
    "for thes in instances_dic:\n",
    "    for type_ent in ['LOC', 'PER']:\n",
    "        list_ent = []\n",
    "        for span in instances_dic[thes][type_ent]:\n",
    "            list_ent.append(process_uri(span.text))\n",
    "        instances_dic[thes][type_ent + '_uri'] = list(set(list_ent))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Preparando o texto em turtle"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Prefixos\n",
    "prefixos = \"\"\" @prefix ns: <http://www.w3.org/2003/06/sw-vocab-status/ns#> .\n",
    "@prefix owl: <http://www.w3.org/2002/07/owl#> .\n",
    "@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .\n",
    "@prefix xml: <http://www.w3.org/XML/1998/namespace> .\n",
    "@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .\n",
    "@prefix bibo: <http://purl.org/ontology/bibo/> .\n",
    "@prefix foaf: <http://xmlns.com/foaf/0.1/> .\n",
    "@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .\n",
    "@prefix skos: <http://www.w3.org/2004/02/skos/core#> .\n",
    "@prefix vann: <http://purl.org/vocab/vann/> .\n",
    "@prefix event: <http://purl.org/NET/c4dm/event.owl#> .\n",
    "@prefix prism: <http://prismstandard.org/namespaces/1.2/basic/> .\n",
    "@prefix terms: <http://purl.org/dc/terms/> .\n",
    "@prefix schema: <http://schemas.talis.com/2005/address/schema#> .\n",
    "@prefix status: <http://purl.org/ontology/bibo/status/> .\n",
    "@prefix degrees: <http://purl.org/ontology/bibo/degrees/> .\n",
    "@prefix stardog: <tag:stardog:api:> .\n",
    "@base <http://www.w3.org/2002/07/owl#> .\n",
    "\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Conectando com o banco e adicionando as triplas"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Funcão que recebe os prefixos e triplas e as carrega à base de dados\n",
    "def add_triplas_to_stardog(prefixos, triplas):\n",
    "\n",
    "    # Incluindo prefixos às triplas\n",
    "    triplas = prefixos + \" \" + triplas\n",
    "\n",
    "    ### Connect to the Stardog database\n",
    "    database_name = 'IndigenousSlavery'\n",
    "    conn = stardog.Connection(database_name, **connection_details)\n",
    "\n",
    "    conn.begin()\n",
    "    conn.add(stardog.content.Raw(triplas, 'text/turtle'))\n",
    "    conn.commit() # commit the transaction"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Preparando as triplas para conectar entidades às teses e carregando à base."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "loc_uri = []\n",
    "for thes in instances_dic:\n",
    "    for loc in instances_dic[thes]['LOC_uri']:\n",
    "        loc_uri.append(loc)\n",
    "\n",
    "triplas = \"\"\" \"\"\"\n",
    "for loc in (set(loc_uri)):\n",
    "    triplas = triplas + \" \" + \"\"\"\n",
    "    stardog:\"\"\" + loc + \"\"\" rdf:type <https://schema.org/Place>.\"\"\"\n",
    "\n",
    "add_triplas_to_stardog(prefixos, triplas)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "per_uri = []\n",
    "for thes in instances_dic:\n",
    "    for per in instances_dic[thes]['PER_uri']:\n",
    "        per_uri.append(per)\n",
    "\n",
    "triplas = \"\"\" \"\"\"\n",
    "for per in (set(per_uri)):\n",
    "    triplas = triplas + \" \" + \"\"\"\n",
    "    stardog:\"\"\" + per + \"\"\" rdf:type foaf:Person.\"\"\"\n",
    "\n",
    "add_triplas_to_stardog(prefixos, triplas)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "triplas = \"\"\" \"\"\"\n",
    "n = 0\n",
    "for thes in instances_dic:\n",
    "    n = n + 1\n",
    "    for loc in instances_dic[thes]['LOC_uri']:\n",
    "        tripla = \"\"\"\n",
    "        stardog:\"\"\" + thes + \"\"\" <https://schema.org/mentions> stardog:\"\"\" + loc + \"\"\".\n",
    "        \"\"\"\n",
    "        triplas = triplas + \" \" + tripla\n",
    "\n",
    "    for per in instances_dic[thes]['PER_uri']:\n",
    "        tripla = \"\"\"\n",
    "        stardog:\"\"\" + thes + \"\"\" <https://schema.org/mentions> stardog:\"\"\" + per + \"\"\".\n",
    "        \"\"\"  \n",
    "        triplas = triplas + \" \" + tripla\n",
    "    \n",
    "add_triplas_to_stardog(prefixos, triplas)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv-IndigSlave",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
