{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "#%pip install beautifulsoup4\n",
    "#%pip install pip-system-certs\n",
    "#% -m pip install ipykernel -U --force-reinstall"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "from bs4 import BeautifulSoup as bs\n",
    "import pandas as pd\n",
    "import os\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from PyPDF2 import PdfReader\n",
    "import fitz\n",
    "from langdetect import detect\n",
    "import spacy\n",
    "import re\n",
    "from unidecode import unidecode\n",
    "import time"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Conectando ao Neo4j "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "# Neo4j variables\n",
    "NEO4J_URL = os.getenv(\"NEO4J_URL\")\n",
    "NEO4J_USERNAME =os.getenv(\"NEO4J_USERNAME\")\n",
    "NEO4J_PASSWORD = os.getenv(\"NEO4J_PASSWORD\")\n",
    "\n",
    "\n",
    "graph = GraphDatabase.driver(NEO4J_URL, auth=(NEO4J_USERNAME, NEO4J_PASSWORD))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "- Buscar os links para a tese no Neo4j\n",
    "- Buscar o link do PDF no repositório da universidade\n",
    "- Baixar o PDF\n",
    "- Extrair o texto do PDF "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Buscar links para a tese no Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Thesis</th>\n",
       "      <th>repository</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>tag:stardog:api:transformacoes_politicas_e_ind...</td>\n",
       "      <td>https://repositorio.ufscar.br/handle/20.500.14...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>tag:stardog:api:sao_benedito_e_a_estacao_das_c...</td>\n",
       "      <td>https://repositorio.ufscar.br/handle/20.500.14...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>tag:stardog:api:direitos_humanos_e_conservador...</td>\n",
       "      <td>https://repositorio.ufscar.br/handle/20.500.14...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>tag:stardog:api:coletivo_de_estudos_e_acoes_in...</td>\n",
       "      <td>https://repositorio.ufscar.br/handle/20.500.14...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>tag:stardog:api:reflexoes_e_possibilidades_sob...</td>\n",
       "      <td>https://repositorio.ufscar.br/handle/20.500.14...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>360</th>\n",
       "      <td>tag:stardog:api:africanidades_e_educacao_popul...</td>\n",
       "      <td>https://repositorio.ufscar.br/handle/20.500.14...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>361</th>\n",
       "      <td>tag:stardog:api:relatos_trajetorias_e_imagens_...</td>\n",
       "      <td>https://repositorio.ufscar.br/handle/20.500.14...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>362</th>\n",
       "      <td>tag:stardog:api:de_coisa_a_sujeito__o_processo...</td>\n",
       "      <td>https://repositorio.ufscar.br/handle/20.500.14...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>363</th>\n",
       "      <td>tag:stardog:api:o_movimento_negro_e_a_cultura_...</td>\n",
       "      <td>https://repositorio.ufscar.br/handle/20.500.14...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>364</th>\n",
       "      <td>tag:stardog:api:dialogos_e_tensoes_o_olhar_de_...</td>\n",
       "      <td>https://repositorio.ufscar.br/handle/20.500.14...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>365 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                Thesis  \\\n",
       "0    tag:stardog:api:transformacoes_politicas_e_ind...   \n",
       "1    tag:stardog:api:sao_benedito_e_a_estacao_das_c...   \n",
       "2    tag:stardog:api:direitos_humanos_e_conservador...   \n",
       "3    tag:stardog:api:coletivo_de_estudos_e_acoes_in...   \n",
       "4    tag:stardog:api:reflexoes_e_possibilidades_sob...   \n",
       "..                                                 ...   \n",
       "360  tag:stardog:api:africanidades_e_educacao_popul...   \n",
       "361  tag:stardog:api:relatos_trajetorias_e_imagens_...   \n",
       "362  tag:stardog:api:de_coisa_a_sujeito__o_processo...   \n",
       "363  tag:stardog:api:o_movimento_negro_e_a_cultura_...   \n",
       "364  tag:stardog:api:dialogos_e_tensoes_o_olhar_de_...   \n",
       "\n",
       "                                            repository  \n",
       "0    https://repositorio.ufscar.br/handle/20.500.14...  \n",
       "1    https://repositorio.ufscar.br/handle/20.500.14...  \n",
       "2    https://repositorio.ufscar.br/handle/20.500.14...  \n",
       "3    https://repositorio.ufscar.br/handle/20.500.14...  \n",
       "4    https://repositorio.ufscar.br/handle/20.500.14...  \n",
       "..                                                 ...  \n",
       "360  https://repositorio.ufscar.br/handle/20.500.14...  \n",
       "361  https://repositorio.ufscar.br/handle/20.500.14...  \n",
       "362  https://repositorio.ufscar.br/handle/20.500.14...  \n",
       "363  https://repositorio.ufscar.br/handle/20.500.14...  \n",
       "364  https://repositorio.ufscar.br/handle/20.500.14...  \n",
       "\n",
       "[365 rows x 2 columns]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Query to get theses and their repositories from the Neo4j database\n",
    "# This query retrieves theses that are published by the Federal University of São Carlos (UFSCar) and have not been processed yet.\n",
    "query1 = \"\"\"\n",
    "MATCH (t:Thesis)-[:publisher]-(uni:University{uri:'tag:stardog:api:UFSCAR'})\n",
    "WHERE NOT EXISTS {(t{processed:true})}\n",
    "RETURN distinct(t[\"uri\"]) as Thesis, t[\"repository\"] as repository \n",
    "\"\"\"\n",
    "\n",
    "# Alternative query to get theses that do not have excerpts and have been processed.\n",
    "query2 = \"\"\" \n",
    "match (t:Thesis)-[:publisher]-(uni:University{uri:'tag:stardog:api:UFSCAR'})\n",
    "where (not (t:Thesis)-[:BFO_0000050]-(:Exerpt)) and  exists {(t{processed:true})}\n",
    "return distinct(t[\"uri\"]) as Thesis, t[\"repository\"] as repository\n",
    "\"\"\"\n",
    "\n",
    "# Query to retrive theses with few pages and their repositories.\n",
    "query3 = \"\"\"\n",
    "MATCH (t:Thesis)-[:publisher]-(uni:University{uri:'tag:stardog:api:UFSCAR'})\n",
    "Match (t:Thesis)-[:BFO_0000050]-(e:Exerpt)\n",
    "RETURN count(e) as pages, t[\"uri\"] as Thesis, t[\"repository\"] as repository\n",
    " order by (pages) limit 40\n",
    "\"\"\"\n",
    "\n",
    "query4 = \"\"\"\n",
    "MATCH (t:Thesis)-[:publisher]-(uni:University{uri:'tag:stardog:api:UFSCAR'})\n",
    "WHERE NOT EXISTS {(t{processed:true})}\n",
    "RETURN distinct(t[\"uri\"]) as Thesis, t[\"title\"] as title \n",
    "\"\"\"\n",
    "\n",
    "query5 = \"\"\"\n",
    "MATCH (t:Thesis {processed: true})-[:publisher]-(uni:University {uri: 'tag:stardog:api:UFSCAR'})\n",
    "WHERE NOT (t)--(:Exerpt)\n",
    "RETURN distinct(t[\"uri\"]) as Thesis, t[\"title\"] as title \n",
    "\"\"\"\n",
    "\n",
    "graph = GraphDatabase.driver(NEO4J_URL, auth=(NEO4J_USERNAME, NEO4J_PASSWORD))\n",
    "results = graph.execute_query(query1).records\n",
    "graph.close()\n",
    "\n",
    "#results = graph.query(query2)\n",
    "# Convert the results to a DataFrame\n",
    "#thesis_repository = pd.DataFrame(results, columns=[\"pages\", \"Thesis\", \"repository\"])\n",
    "thesis_repository = pd.DataFrame(results, columns=[\"Thesis\", \"repository\"])\n",
    "thesis_repository = thesis_repository.reset_index(drop=True) \n",
    "thesis_repository"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "https://repositorio.ufscar.br/handle/20.500.14289/7663\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "['https://repositorio.ufscar.br/server/api/core/bitstreams/a6bc209c-44dc-4f5a-bc96-e0b36752da97/content']"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "repo = thesis_repository['repository'][0]\n",
    "print(repo)\n",
    "get_pdf_link(repo)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Criando as utils functions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Funcao para coletar link do repositorio na página da BDTD\n",
    "\n",
    "#def get_repository_link(title):\n",
    "\n",
    "#    bdtd_url = 'https://bdtd.ibict.br/vufind/Search/Results?lookfor=' + title.replace(' ', '+') + '&type=Title' #&limit=1'\n",
    "    #Fazer requisição e parsear o arquivo html\n",
    "#    try:\n",
    "#        f = requests.get(bdtd_url, verify=True).text#, verify=False) \n",
    "#    except:\n",
    "#        print(\"Sleeping for 5 seconds before retrying... (get_repository_link)\")\n",
    "#        time.sleep(5)\n",
    "#        try:\n",
    "#            f = requests.get(bdtd_url, verify=True).text#, verify=False) \n",
    "#        except:\n",
    "#            print(\"Sleeping for 30 seconds before retrying... (get_repository_link)\")\n",
    "#            time.sleep(30)\n",
    "#            f = requests.get(bdtd_url, verify=True).text#, verify=False)    \n",
    "#    soup = bs(f, \"html.parser\")\n",
    "\n",
    "    #Coletando link para o repositório\n",
    "#    link_list = []\n",
    "#    for doc in soup.find_all('a', href=True):\n",
    "\n",
    "#        if (doc['href'].startswith('https://repositorio.ufsc.br/') |\n",
    "#            doc['href'].startswith('http://repositorio.ufsc.br/')):\n",
    "#            path = doc['href']\n",
    "#            link_list.append(path)\n",
    "#    if link_list != []:\n",
    "#        return list(set(link_list))[0]\n",
    "#    else:\n",
    "#        return None\n",
    "\n",
    "\n",
    "\n",
    "# Funcao para coletar link do pdf\n",
    "\n",
    "def get_pdf_link(url):\n",
    "    \n",
    "    headers = {\n",
    "    'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/58.0.3029.110 Safari/537.3'\n",
    "                }\n",
    "\n",
    "    #Fazer requisição e parsear o arquivo html\n",
    "    try:\n",
    "        f = requests.get(url, headers=headers, verify=True).text#, verify=False) \n",
    "        \n",
    "    except:\n",
    "        print(\"Sleeping for 5 seconds before retrying... (get_pdf_link)\")\n",
    "        time.sleep(5)\n",
    "        try:\n",
    "            f = requests.get(url, headers=headers, verify=True).text#, verify=False) \n",
    "        except:\n",
    "            print(\"Sleeping for 30 seconds before retrying... (get_pdf_link)\")\n",
    "            time.sleep(30)\n",
    "            f = requests.get(url, headers=headers, verify=True).text#, verify=False)    \n",
    "    soup = bs(f, \"html.parser\")\n",
    "    \n",
    "    #Coletando link para as teses\n",
    "    link_list = []\n",
    "    for doc in soup.find_all('a', href=True):\n",
    "        if doc['href'].startswith('/bitstreams/'):     # (doc['href'].endswith('.pdf')):# & doc['href'].startswith('/bitstream')):\n",
    "            path = doc['href']\n",
    "            prefix_uni = 'https://repositorio.ufscar.br/server/api/core'\n",
    "            link = prefix_uni + path.replace('download', 'content')\n",
    "            link_list.append(link)\n",
    "    if link_list != []:\n",
    "        return list(set(link_list))\n",
    "    else:\n",
    "        return None\n",
    "    \n",
    "    #return None\n",
    "\n",
    "#fazer download do arquivo\n",
    "def download_file(pdf_link, thesis_uri):\n",
    "\n",
    "    headers = {\n",
    "    'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/58.0.3029.110 Safari/537.3'\n",
    "                }\n",
    "    \n",
    "    # NOTE the stream=True parameter below\n",
    "    try:\n",
    "        r = requests.get(pdf_link, headers=headers, verify=True, stream=True)\n",
    "    except:\n",
    "        print(\"Sleeping for 5 seconds before retrying... (download_file)\")\n",
    "        time.sleep(5)\n",
    "        try:\n",
    "            r = requests.get(pdf_link, headers=headers, verify=True, stream=True)\n",
    "        except:\n",
    "            print(\"Sleeping for 30 seconds before retrying... (download_file)\")\n",
    "            time.sleep(30)\n",
    "            r = requests.get(pdf_link, headers=headers, verify=True, stream=True)\n",
    "    # raise_for_status() is not needed with stream=True\n",
    "    # r.raise_for_status()\n",
    "    with open('tese UFSCAR.pdf', 'wb') as f:\n",
    "        for chunk in r.iter_content(chunk_size=8192):\n",
    "            f.write(chunk)\n",
    "    return \n",
    "\n",
    "#Carregando os modelos SpaCy para inglês e português \n",
    "nlp_en = spacy.load(\"en_core_web_lg\")\n",
    "nlp_pt = spacy.load(\"pt_core_news_lg\")\n",
    "\n",
    "# Funcão que recebe uma string e a limpar para ficar no formato aceitável para uma URI\n",
    "def process_uri(x):\n",
    "    return (re.sub('[^a-zA-Z0-9_ ]', '',\n",
    "            unidecode(x.strip())\n",
    "                        .replace(\" \", \"_\")\n",
    "                        .replace(\"[\",\"\")\n",
    "                        .replace(\"]\",\"\")\n",
    "                        .replace(\"?\",\"\")\n",
    "                        .replace(\"'\",\"\")\n",
    "                        .lower()))\n",
    "\n",
    "\n",
    "# Função para extrair texto de uma tese em PDF e identificar entidades\n",
    "def extratc_text(tese_path):\n",
    "    \n",
    "    # Processando o arquivo em PDF\n",
    "    try:\n",
    "        reader = PdfReader(tese_path)\n",
    "        number_of_pages = len(reader.pages)\n",
    "    \n",
    "        excerpt = {}\n",
    "\n",
    "        extractor = 'PdfReader'\n",
    "\n",
    "    except:\n",
    "        reader = fitz.open(tese_path)\n",
    "        number_of_pages = len(reader)\n",
    "    \n",
    "        excerpt = {}\n",
    "        \n",
    "        extractor = 'PyMuPDF'\n",
    "\n",
    "    # Iterando por cada página\n",
    "    for page_number in range(number_of_pages):\n",
    "\n",
    "        # Verificando qual extrator de pdf foi utilizado    \n",
    "        if extractor == 'PdfReader':\n",
    "\n",
    "            # Extraindo o texto da página\n",
    "            try:\n",
    "                if page_number == 0:\n",
    "                    try:\n",
    "                        page_text = (reader.pages[page_number].extract_text() + '\\n ' \n",
    "                                    + reader.pages[page_number+1].extract_text()[:400])\n",
    "                    except:\n",
    "                        page_text = reader.pages[page_number].extract_text()\n",
    "                else:\n",
    "                    \n",
    "                    if page_number == number_of_pages -1:\n",
    "                        try:\n",
    "                            page_text = (reader.pages[page_number-1].extract_text()[-400:] + '\\n ' \n",
    "                                        + reader.pages[page_number].extract_text())\n",
    "                        except:\n",
    "                            page_text = reader.pages[page_number].extract_text()\n",
    "                    \n",
    "                    else:\n",
    "                        try:\n",
    "                            page_text = (reader.pages[page_number-1].extract_text()[-400:] + '\\n ' \n",
    "                                        + reader.pages[page_number].extract_text() + '\\n ' \n",
    "                                        + reader.pages[page_number+1].extract_text()[:400])  \n",
    "                        except:\n",
    "                            page_text = reader.pages[page_number].extract_text()\n",
    "            except:\n",
    "                page_text = ''\n",
    "            \n",
    "        else:\n",
    "                \n",
    "            # Extraindo o texto da página\n",
    "            try:\n",
    "                if page_number == 0:\n",
    "                    try:\n",
    "                        page_text = (reader[page_number].get_text() + '\\n ' \n",
    "                                    + reader[page_number+1].get_text()[:400])\n",
    "                    except:\n",
    "                        page_text = reader[page_number].get_text()\n",
    "                else:\n",
    "                    \n",
    "                    if page_number == number_of_pages -1:\n",
    "                        try:\n",
    "                            page_text = (reader[page_number-1].get_text()[-400:] + '\\n ' \n",
    "                                        + reader[page_number].get_text())\n",
    "                        except:\n",
    "                            page_text = reader[page_number].get_text()\n",
    "                    \n",
    "                    else:\n",
    "                        try:\n",
    "                            page_text = (reader[page_number-1].get_text()[-400:] + '\\n ' \n",
    "                                        + reader[page_number].get_text() + '\\n ' \n",
    "                                        + reader[page_number+1].get_text()[:400])  \n",
    "                        except:\n",
    "                            page_text = reader[page_number].get_text()\n",
    "\n",
    "            except:\n",
    "                page_text = ''\n",
    "\n",
    "        # Limpando page text         \n",
    "        page_text = page_text.replace(\"'\", \"\").replace('\"', '')\n",
    "        # Verifica se o último caractere é uma barra invertida\n",
    "        if page_text != '':\n",
    "            if page_text[-1] == '\\\\': \n",
    "                page_text = page_text[:-2]\n",
    "        page_text = re.sub(r\"[\\ud800-\\udfff]\", \" \", page_text)\n",
    "        page_text = page_text.encode('utf-8').decode('utf-8')\n",
    "        \n",
    "        \n",
    "        # Detectando o idioma do texto\n",
    "        try:\n",
    "            lang = detect(page_text)\n",
    "            \n",
    "        except:\n",
    "            lang = 'Não_detectado'\n",
    "        \n",
    "        \n",
    "        # Extraindo as entidades\n",
    "        page_extracted = False\n",
    "        if lang == 'pt':\n",
    "            doc = nlp_pt(page_text)\n",
    "            page_extracted = True\n",
    "        if lang == 'en':\n",
    "            doc = nlp_en(page_text)\n",
    "            page_extracted = True\n",
    "        \n",
    "\n",
    "        if page_extracted:\n",
    "\n",
    "            persons = []\n",
    "            gpes = []\n",
    "            #orgs = []\n",
    "            for ent in doc.ents:\n",
    "                if ent.label_ == \"PER\": #\"PERSON\":\n",
    "                    persons.append(process_uri(ent.text))\n",
    "                if ent.label_ == \"LOC\": #\"GPE\":\n",
    "                    gpes.append(process_uri(ent.text))\n",
    "                #if ent.label_ == \"ORG\":\n",
    "                #    orgs.append(process_uri(ent.text))\n",
    "                    \n",
    "            excerpt[page_number] = {'text': page_text, \n",
    "                                    'lang': lang, \n",
    "                                    'persons': list(set(persons)), \n",
    "                                    'gpes': list(set(gpes)),\n",
    "                                #'orgs': list(set(orgs))\n",
    "                                }\n",
    "\n",
    "    return excerpt"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Iterando por todas as URI para extrair o texto e gravar no grafo NEO4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 - Downloading and extracting: transformacoes_politicas_e_indigenas__movimento_e_prefeitura_no_alto_rio_negro from https://repositorio.ufscar.br/server/api/core/bitstreams/a6bc209c-44dc-4f5a-bc96-e0b36752da97/content\n",
      "Loading triplas: transformacoes_politicas_e_indigenas__movimento_e_prefeitura_no_alto_rio_negro\n",
      "Total time: 0 days 00:00:35.525554\n",
      "Partial time: 0 days 00:00:35.525554\n",
      "1 - Downloading and extracting: sao_benedito_e_a_estacao_das_curas_saude_devocao_e_constituicoes_do_territorio_sulmineiro from https://repositorio.ufscar.br/server/api/core/bitstreams/70e08680-0a36-4e52-bff9-5d4f0e761bfe/content\n",
      "Loading triplas: sao_benedito_e_a_estacao_das_curas_saude_devocao_e_constituicoes_do_territorio_sulmineiro\n",
      "Total time: 0 days 00:02:54.650399\n",
      "Partial time: 0 days 00:02:19.124845\n",
      "2 - Downloading and extracting: direitos_humanos_e_conservadorismo_contemporaneo_a_agenda_dos_deputados_do_partido_social_liberal_psl_56a_legislatura_20192023 from https://repositorio.ufscar.br/server/api/core/bitstreams/8a799355-a43f-429d-8aec-a331eb9b0416/content\n",
      "Loading triplas: direitos_humanos_e_conservadorismo_contemporaneo_a_agenda_dos_deputados_do_partido_social_liberal_psl_56a_legislatura_20192023\n",
      "Total time: 0 days 00:03:20.844071\n",
      "Partial time: 0 days 00:00:26.193672\n",
      "3 - Downloading and extracting: coletivo_de_estudos_e_acoes_indigenas_ceai_da_resistencia_a_afirmacao__a_colecao_retomadas from https://repositorio.ufscar.br/server/api/core/bitstreams/8ab94bad-6d2f-4511-804c-efccb1f4b859/content\n",
      "Loading triplas: coletivo_de_estudos_e_acoes_indigenas_ceai_da_resistencia_a_afirmacao__a_colecao_retomadas\n",
      "Total time: 0 days 00:03:51.089302\n",
      "Partial time: 0 days 00:00:30.245231\n",
      "4 - Downloading and extracting: reflexoes_e_possibilidades_sobre_a_quantificacao_dos_surdos_sinalizantes_nos_levantamentos_censitarios_brasileiros from https://repositorio.ufscar.br/server/api/core/bitstreams/193d795c-f06b-4d18-8b13-7fc89ec6dfba/content\n",
      "Loading triplas: reflexoes_e_possibilidades_sobre_a_quantificacao_dos_surdos_sinalizantes_nos_levantamentos_censitarios_brasileiros\n",
      "Total time: 0 days 00:04:15.816972\n",
      "Partial time: 0 days 00:00:24.727670\n",
      "5 - Downloading and extracting: educacao_antropofagica_apropriacao_cultural_indigena_pelos_jesuitas_no_inicio_da_colonizacao_portuguesa_do_brasil_15491599 from https://repositorio.ufscar.br/server/api/core/bitstreams/dbe269bb-1109-4bf7-bcf2-bf10c10d670c/content\n",
      "Loading triplas: educacao_antropofagica_apropriacao_cultural_indigena_pelos_jesuitas_no_inicio_da_colonizacao_portuguesa_do_brasil_15491599\n",
      "Total time: 0 days 00:05:18.568465\n",
      "Partial time: 0 days 00:01:02.752508\n",
      "6 - Downloading and extracting: modelando_a_vida_sentipensando_com_o_barro_processos_educativos_na_producao_e_criacao_ceramica_do_alto_vale_do_ribeira from https://repositorio.ufscar.br/server/api/core/bitstreams/05362729-bf16-4aff-aa13-6f4236111ad7/content\n",
      "Loading triplas: modelando_a_vida_sentipensando_com_o_barro_processos_educativos_na_producao_e_criacao_ceramica_do_alto_vale_do_ribeira\n",
      "Total time: 0 days 00:07:16.475342\n",
      "Partial time: 0 days 00:01:57.905862\n",
      "7 - Downloading and extracting: relacao_entre_feicoes_geomorfologicas_fluviais_e_sitios_arqueologicos_na_bacia_do_medio_tiete__sao_paulo from https://repositorio.ufscar.br/server/api/core/bitstreams/f6e1f26f-f99d-48f8-bd99-5644eba18d1d/content\n",
      "Loading triplas: relacao_entre_feicoes_geomorfologicas_fluviais_e_sitios_arqueologicos_na_bacia_do_medio_tiete__sao_paulo\n",
      "Total time: 0 days 00:07:39.824849\n",
      "Partial time: 0 days 00:00:23.349507\n",
      "8 - Downloading and extracting: conectando_saberes_possiveis_dialogos_entre_conhecimentos_cientificos_e_tradicionais from https://repositorio.ufscar.br/server/api/core/bitstreams/71274a92-2794-4aca-87f9-7d94ece4342c/content\n",
      "Loading triplas: conectando_saberes_possiveis_dialogos_entre_conhecimentos_cientificos_e_tradicionais\n",
      "Total time: 0 days 00:08:23.453447\n",
      "Partial time: 0 days 00:00:43.629105\n",
      "9 - Downloading and extracting: forma_escolar_dos_aldeamentos_jesuiticos_do_seculo_xvi from https://repositorio.ufscar.br/server/api/core/bitstreams/ce764c37-9368-4cdc-a4b5-32e1fe444842/content\n",
      "Loading triplas: forma_escolar_dos_aldeamentos_jesuiticos_do_seculo_xvi\n",
      "Total time: 0 days 00:08:46.047920\n",
      "Partial time: 0 days 00:00:22.593966\n",
      "10 - Downloading and extracting: a_educacao_das_relacoes_etnicoraciais_no_ensino_de_arte_a_partir_de_uma_perspectiva_intercultural from https://repositorio.ufscar.br/server/api/core/bitstreams/02bbe862-6c9c-43d8-9da7-e71e27a9ebb1/content\n",
      "Loading triplas: a_educacao_das_relacoes_etnicoraciais_no_ensino_de_arte_a_partir_de_uma_perspectiva_intercultural\n",
      "Total time: 0 days 00:09:59.920402\n",
      "Partial time: 0 days 00:01:13.873474\n",
      "11 - Downloading and extracting: a_institucionalizacao_das_acoes_afirmativas_estudantis_na_universidade_estadual_do_piaui_uespi_avancos_a_contagotas from https://repositorio.ufscar.br/server/api/core/bitstreams/e6b9f6b9-3874-411f-91f3-7ac5f5479d75/content\n",
      "Loading triplas: a_institucionalizacao_das_acoes_afirmativas_estudantis_na_universidade_estadual_do_piaui_uespi_avancos_a_contagotas\n",
      "Total time: 0 days 00:11:23.266276\n",
      "Partial time: 0 days 00:01:23.345873\n",
      "12 - Downloading and extracting: o_efeito_mais_que_etnografico_literatura_como_retomada_autoria_e_ativismo_de_mulheres_indigenas from https://repositorio.ufscar.br/server/api/core/bitstreams/0eb65c0b-9eaa-447f-b8bb-8e6ee27c6d5d/content\n",
      "Loading triplas: o_efeito_mais_que_etnografico_literatura_como_retomada_autoria_e_ativismo_de_mulheres_indigenas\n",
      "Total time: 0 days 00:12:21.486094\n",
      "Partial time: 0 days 00:00:58.218827\n",
      "13 - Downloading and extracting: o_barro_espirra_respira_e_inspira_reflexoes_sobre_o_trabalho_feminino_na_arte_ceramica_de_icoaraci_belem_para from https://repositorio.ufscar.br/server/api/core/bitstreams/4e1bfcf3-8ab2-402e-ac6d-1aefecfeb903/content\n",
      "Loading triplas: o_barro_espirra_respira_e_inspira_reflexoes_sobre_o_trabalho_feminino_na_arte_ceramica_de_icoaraci_belem_para\n",
      "Total time: 0 days 00:12:58.103579\n",
      "Partial time: 0 days 00:00:36.617485\n",
      "14 - Downloading and extracting: agenciamentos_juvenis_a_partir_de_uma_pesquisa_em_escolas_do_ensino_medio from https://repositorio.ufscar.br/server/api/core/bitstreams/56e020a1-1be3-4dc3-b144-252c667de5cf/content\n"
     ]
    }
   ],
   "source": [
    "# Gravar hora de início do processamento\n",
    "start_time = pd.Timestamp.now()\n",
    "parcial_time = pd.Timestamp.now()\n",
    "\n",
    "for i in range(0,len(thesis_repository)):\n",
    "\n",
    "    #title ='The problem of identity as it relates to the american black\\'s vision of Africa'\n",
    "    #title = thesis_repository['title'][i].replace(\"?\",\"\").replace('-', ' ').replace('&', ' ').replace('/', ' ').replace('\\\\', ' ')  \n",
    "    #repo = get_repository_link(title)\n",
    "\n",
    "    # Coletando o link do PDF\n",
    "    url = thesis_repository['repository'][i]\n",
    "    thesis_uri = thesis_repository['Thesis'][i][16:]\n",
    "    pdf_link = get_pdf_link(url)\n",
    "    if pdf_link is not None:\n",
    "        # Itereando pelos links de PDF encontrados (em alguns casos há outros materiais além da tese)\n",
    "        for pdf_num in range(len(pdf_link)):\n",
    "            print(f\"{i} - Downloading and extracting: {thesis_uri} from {pdf_link[pdf_num]}\")\n",
    "            download_file(pdf_link[pdf_num], thesis_uri)\n",
    "\n",
    "            # Extraindo o texto e entidades\n",
    "            tese_path = 'tese UFSCAR.pdf'\n",
    "            excerpt = extratc_text(tese_path)\n",
    "\n",
    "            excerpts = []\n",
    "            persons = []\n",
    "            gpes = []\n",
    "\n",
    "            # Salvando as triplas em CSV\n",
    "            for n in excerpt.keys():\n",
    "\n",
    "                excerpt_uri = thesis_repository['Thesis'][i] + '_pdf_' + str(pdf_num) + '_p_' + str(n)\n",
    "                excerpt_text = excerpt[n]['text']\n",
    "                # Verifica se o último caractere é uma barra invertida\n",
    "                #if excerpt_text[-1] == '\\\\': \n",
    "                #    excerpt_text = excerpt_text[:-1]\n",
    "                \n",
    "\n",
    "                excerpt_page = 'pdf_' + str(pdf_num) + '_p_' + str(n)\n",
    "                excerpt_lang = excerpt[n]['lang']\n",
    "                \n",
    "                excerpts.append([thesis_repository['Thesis'][i], excerpt_uri, excerpt_text, excerpt_page, excerpt_lang])\n",
    "                    \n",
    "                #Criando as relações com as entidades\n",
    "                for person in excerpt[n]['persons']:\n",
    "                    persons.append([excerpt_uri, 'tag:stardog:api:' + person])\n",
    "                \n",
    "                for gpe in excerpt[n]['gpes']:\n",
    "                    gpes.append([excerpt_uri, 'tag:stardog:api:' + gpe])\n",
    "            \n",
    "            # Salvando os dados em CSV no diretório de importação do Neo4j\n",
    "            pd.DataFrame(excerpts).to_csv('C:\\\\Users\\\\facordei\\\\.Neo4jDesktop\\\\relate-data\\\\dbmss\\\\dbms-792eabfc-5517-4220-ab29-30ef6ec3236e\\\\import\\\\excerptsUFSCAR.csv', index=False, header=False)\n",
    "            pd.DataFrame(persons).to_csv('C:\\\\Users\\\\facordei\\\\.Neo4jDesktop\\\\relate-data\\\\dbmss\\\\dbms-792eabfc-5517-4220-ab29-30ef6ec3236e\\\\import\\\\personsUFSCAR.csv', index=False, header=False)\n",
    "            pd.DataFrame(gpes).to_csv('C:\\\\Users\\\\facordei\\\\.Neo4jDesktop\\\\relate-data\\\\dbmss\\\\dbms-792eabfc-5517-4220-ab29-30ef6ec3236e\\\\import\\\\gpesUFSCAR.csv', index=False, header=False)\n",
    "\n",
    "            #Deletando o arquivo PDF após o processamento\n",
    "            os.remove('tese UFSCAR.pdf')\n",
    "\n",
    "            print(f\"Loading triplas: {thesis_uri}\")\n",
    "\n",
    "            # Importanto os dados para o Neo4j\n",
    "            #Excerpts\n",
    "            query = \"\"\"\n",
    "            LOAD CSV FROM 'file:///excerptsUFSCAR.csv'\n",
    "            AS row\n",
    "            MATCH  (t:Thesis{uri: row[0]})\n",
    "            MERGE  (e:Exerpt{\n",
    "                    uri: row[1],\n",
    "                    text: row[2],\n",
    "                    page: row[3],\n",
    "                    lang: row[4]\n",
    "                    })-[r:BFO_0000050]-(t);\n",
    "            \"\"\"\n",
    "            graph = GraphDatabase.driver(NEO4J_URL, auth=(NEO4J_USERNAME, NEO4J_PASSWORD))\n",
    "            results = graph.execute_query(query)\n",
    "            graph.close()\n",
    "\n",
    "            #Persons\n",
    "            query = \"\"\"\n",
    "            LOAD CSV FROM 'file:///personsUFSCAR.csv'\n",
    "            AS row\n",
    "            MATCH  (e:Exerpt{uri: row[0]})\n",
    "            MERGE  (p:Person{uri: row[1]})\n",
    "            MERGE  (e)-[r:mentions]-(p);\n",
    "            \"\"\"\n",
    "            graph = GraphDatabase.driver(NEO4J_URL, auth=(NEO4J_USERNAME, NEO4J_PASSWORD))\n",
    "            results = graph.execute_query(query)\n",
    "            graph.close()\n",
    "\n",
    "            #GPEs\n",
    "            query = \"\"\"\n",
    "            LOAD CSV FROM 'file:///gpesUFSCAR.csv'\n",
    "            AS row\n",
    "            MATCH  (e:Exerpt{uri: row[0]})\n",
    "            MERGE  (p:Place{uri: row[1]})\n",
    "            MERGE  (e)-[r:mentions]-(p);\n",
    "            \"\"\"\n",
    "            graph = GraphDatabase.driver(NEO4J_URL, auth=(NEO4J_USERNAME, NEO4J_PASSWORD))\n",
    "            results = graph.execute_query(query)\n",
    "            graph.close()\n",
    "\n",
    "            # Removendo os arquivos CSV após a importação\n",
    "            os.remove('C:\\\\Users\\\\facordei\\\\.Neo4jDesktop\\\\relate-data\\\\dbmss\\\\dbms-792eabfc-5517-4220-ab29-30ef6ec3236e\\\\import\\\\excerptsUFSCAR.csv')\n",
    "            os.remove('C:\\\\Users\\\\facordei\\\\.Neo4jDesktop\\\\relate-data\\\\dbmss\\\\dbms-792eabfc-5517-4220-ab29-30ef6ec3236e\\\\import\\\\personsUFSCAR.csv')\n",
    "            os.remove('C:\\\\Users\\\\facordei\\\\.Neo4jDesktop\\\\relate-data\\\\dbmss\\\\dbms-792eabfc-5517-4220-ab29-30ef6ec3236e\\\\import\\\\gpesUFSCAR.csv')\n",
    "\n",
    "            print(f\"Total time: {pd.Timestamp.now() - start_time}\")\n",
    "            print(f\"Partial time: {pd.Timestamp.now() - parcial_time}\")\n",
    "            # Atualizando a hora parcial\n",
    "            parcial_time = pd.Timestamp.now()\n",
    "    else:\n",
    "        print(f\"No PDF link found for {thesis_uri}\")\n",
    "\n",
    "    # gravando no grafo que a tese foi processada\n",
    "    query = \"\"\"\n",
    "    MATCH  (t:Thesis{uri: \\'\"\"\" + thesis_repository['Thesis'][i] +  \"\"\"\\'})\n",
    "    SET t.processed = true\n",
    "    \"\"\"\n",
    "    graph = GraphDatabase.driver(NEO4J_URL, auth=(NEO4J_USERNAME, NEO4J_PASSWORD))\n",
    "    results = graph.execute_query(query)\n",
    "    graph.close()\n",
    "    #break\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv-IndigSlave (3.11.9)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
